---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.SelectedElementsArePartOfOtherCircuit
source: html/8ffe87b6-1fcc-c499-b46d-9c7e2f15137a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.SelectedElementsArePartOfOtherCircuit Property

You have selected elements that are already part of other Circuits. They will be removed from the original Circuits and added to this one.

## Syntax (C#)
```csharp
public static FailureDefinitionId SelectedElementsArePartOfOtherCircuit { get; }
```